tap "derailed/k9s"
tap "int128/kauthproxy"
tap "int128/kubelogin"

brew "container-structure-test"
brew "direnv"
brew "git-lfs"
brew "helm"
brew "helmfile"
brew "k9s"
brew "kind"
brew "krew"
brew "kubernetes-cli"
brew "kustomize"
brew "podman"
brew "skaffold"
brew "websocat"
brew "yq"

vscode "bierner.markdown-mermaid"
vscode "bradgashler.htmltagwrap"
vscode "DavidAnson.vscode-markdownlint"
vscode "ecmel.vscode-html-css"
vscode "pranaygp.vscode-css-peek"
vscode "esbenp.prettier-vscode"
vscode "foxundermoon.shell-format"
vscode "GitHub.github-vscode-theme"
vscode "GitHub.remotehub"
vscode "GitHub.vscode-pull-request-github"
vscode "GitLab.gitlab-workflow"
vscode "Gruntfuggly.todo-tree"
vscode "hashicorp.terraform"
vscode "hediet.vscode-drawio"
vscode "James-Yu.latex-workshop"
vscode "jeff-hykin.better-dockerfile-syntax"
vscode "maptz.regionfolder"
vscode "mindaro-dev.file-downloader"
vscode "mindaro.mindaro"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-ossdata.vscode-postgresql"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.live-server"
vscode "ms-vscode.remote-explorer"
vscode "ms-vsliveshare.vsliveshare"
vscode "njpwerner.autodocstring"
vscode "redhat.vscode-yaml"
vscode "Remisa.shellman"
vscode "tamasfe.even-better-toml"
vscode "timonwong.shellcheck"
vscode "tomoki1207.pdf"
vscode "vincaslt.highlight-matching-tag"
vscode "yzane.markdown-pdf"
vscode "yzhang.markdown-all-in-one"
